Repository: sciencewhiz/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/basic-programming/java-units.po
Languages: es_mx

source: Unit
es_mx: Unidad

source: Units are specific realizations of dimensions. They are the way of expressing physical quantities. Each dimension has a base unit, such as the meter for length, the second for time, the kilogram for mass. Derived units are formed by combining base units, such as meters per second for velocity.
es_mx: Las unidades son realizaciones específicas de dimensiones. Son la forma de expresar cantidades físicas. Cada dimensión tiene una unidad base, como el metro para la longitud, el segundo para el tiempo, el kilogramo para la masa. Las unidades derivadas se forman combinando unidades base, como metros por segundo para la velocidad.

source: Measure
es_mx: Medida

source: Measures are the specific magnitude of physical quantities, expressed in a particular unit. For example, 5 meters is a measure of distance.
es_mx: Las medidas son la magnitud específica de las cantidades físicas, expresadas en una unidad particular. Por ejemplo, 5 metros es una medida de distancia.

source: These concepts are used within the Units Library. For example, the **measure** *10 seconds* has a magnitude of 10, the **dimension** is time, and the **unit** is seconds.
es_mx: Estos conceptos se utilizan dentro de la Biblioteca de Unidades. Por ejemplo, la **medida** *10 segundos* tiene una magnitud de 10, la **dimensión** es tiempo y la **unidad** es segundos.

source: Using the Units Library
es_mx: Usar la Biblioteca de Unidades

source: The Java units library is available in the ``edu.wpi.first.units`` package. The most relevant classes are:
es_mx: La biblioteca de unidades de Java está disponible en el paquete "edu.wpi.first.units". Las clases más relevantes son:

source: The various classes for predefined dimensions, such as `Distance <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Distance.html>`__ and `Time <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Time.html>`__
es_mx: Las diversas clases para dimensiones predefinidas, como `Distance <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Distance.html>`__ and `Time <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Time.html>`__

source: `Units <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Units.html>`__, which contains a set of predefined units. Take a look a the `Units javadoc <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Units.html>`__ to browse the available units and their types.
es_mx: Unidades <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Units.html>__, que contiene un conjunto de unidades predefinidas. Echa un vistazo a la `documentación de Units javadoc <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Units.html>`__ para explorar las unidades disponibles y sus tipos.

source: `Measure <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Measure.html>`__, which is used to tag a value with a unit.
es_mx: Medida <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/units/Measure.html>`__, que se utilizan para etiquetar un valor con una unidad.

source: It is recommended to static import ``edu.wpi.first.units.Units.*`` to get full access to all the predefined units.
es_mx: Se recomienda importar estáticamente ``edu.wpi.first.units.Units.*`` para tener acceso completo a todas las unidades predefinidas.

source: Java Generics
es_mx: Genéricos de java

source: Units of measurement can be complex expressions involving various dimension, such as distance, time, and velocity. Nested `generic type parameters <https://docs.oracle.com/javase/tutorial/java/generics/index.html>`__ allow for the definition of units that can represent such complex expressions. Generics are used to keep the library concise, reusable, and extensible, but it tends to be verbose due to the syntax for Java generics.
es_mx: Las unidades de medida pueden ser expresiones complejas que involucran varias dimensiones, como distancia, tiempo y velocidad. Los parámetros de tipo genérico,<https://docs.oracle.com/javase/tutorial/java/generics/index.html>`__ anidados permiten la definición de unidades que pueden representar dichas expresiones complejas. Los genéricos se utilizan para mantener la biblioteca concisa, reutilizable y extensible, pero tienden a ser verbosos debido a la sintaxis de los genéricos de Java.

source: For instance, consider the type ``Measure<Velocity<Distance>>``. This type represents a measurement for velocity, where the velocity itself is expressed as a unit of distance per unit of time. This nested structure allows for the representation of units like meters per second or feet per minute. Similarly, the type ``Measure<Per<Voltage, Velocity<Distance>>>`` represents a measurement for a ratio of voltage to velocity. This type is useful for representing quantities like volts per meter per second, the unit of measure for some :ref:`feedforward<docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>` gains.
es_mx: Por ejemplo, considera el tipo ``Measure<Velocity<Distance>>``. Este tipo representa una medida para la velocidad, donde la velocidad misma se expresa como una unidad de distancia por unidad de tiempo. Esta estructura anidada permite la representación de unidades como metros por segundo o pies por minuto. De manera similar, el tipo ``Measure<Per<Voltage, Velocity<Distance>>>`` representa una medida para una relación de voltaje a velocidad. Este tipo es útil para representar cantidades como voltios por metro por segundo, la unidad de medida para algunos ganancias de :ref:`feedforward<docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib>`.
