Repository: sciencewhiz/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/index.po
Languages: es, ja

source: FRC Beta Test
es: Prueba beta de FRC
ja: FRCベータテスト

source: Zero to Robot
es: Cero a Robot
ja: ゼロからロボットまで

source: Control System Overviews
es: Descripción general del sistema de control
ja: 制御システムの概要

source: Programming Basics
es: Conceptos básicos de programación
ja: プログラミングの基礎

source: WPILib Java API Docs
es: Documentos API de WPILib Java
ja: WPILib Java API のドキュメンテーション

source: WPILib C++ API Docs
es: Documentos API de WPILib C++
ja: WPILib C++ API のドキュメンテーション

source: API Docs
es: Documentos API
ja: API のドキュメンテーション

source: Software Tools
es: Herramientas de software
ja: ソフトウェアツール

source: Advanced Programming
es: Programación avanzada
ja: 高度なプログラミング

source: Examples and Tutorials
es: Ejemplos y tutoriales
ja: 例とチュートリアル

source: Hardware
ja: ハードウェア

source: Romi and XRP Support
es: Romi y Soporte de XRP
ja: RomiとXRPのサポート

source: Robot Networking
es: Conexiones de Robot
ja: ロボット・ネットワーキング

source: Contributing
es: Contribuir
ja: 貢献する

source: Report an Issue
es: Reportar un Problema
ja: 問題を報告する

source: FIRST Robotics Competition Control System
es: El Sistema de Control de FRC
ja: FIRST Robotics Competition コントロールシステム

source: Welcome to the *FIRST*\ |reg| Robotics Competition Control System Documentation! This site contains everything you need to know for programming a competition robot!
es: ¡Bienvenido a la Documentación de Sistema de Control de *FIRST*\ |reg| Robotics Competition! ¡Este sitio contiene todo lo que necesitas saber para programar un robot de competencia!
ja: *FIRST*\ |reg| Robotics Competition の制御システムのドキュメンテーションへようこそ！このサイトには、競技用ロボットのプログラミングに必要なすべてが含まれています！

source: Community translations can be found in a variety of languages in the bottom-left menu.
es: Las traducciones comunitarias se encuentran en varios idiomas en el menú inferior izquierdo.
ja: コミュニティによる翻訳は、左下のメニューからさまざまな言語でアクセスできます。

source: **Returning Teams**
es: **Equipos que regresan**
ja: **再参加チーム**

source: If you are a returning team, please check out the overview of changes from 2023 to 2024, known issues, and quick start guide for updating.
ja: 再参加チームの方は、2023年から2024年への変更の概要、既知の問題、および更新のためのクイックスタートガイドをチェックしてください。

source: Changelog
es: Registro de cambios
ja: 変更履歴

source: Known Issues
es: Problemas Conocidos
ja: 既知の問題

source: Quick Start
ja: クイックスタート

source: **New Teams**
es: **Nuevos Equipos**
ja: **新しいチーム**

source: The Zero-to-Robot tutorial will guide you through preparation, wiring and programming a basic robot!
es: ¡El tutorial de Cero a Robot lo guiará a través de la preparación, cableado y la programación básica del robot!
ja: 「ゼロからロボットまで」のチュートリアルは、ロボットの準備、配線、およびプログラミングについて説明します。

source: Go to Zero-to-Robot
es: Ve a Zero-to-Robot
ja: 「ゼロからロボットまで」へ進む

source: **Hardware Overview**
ja: **ハードウェアの概要**

source: An overview of the hardware components available to teams.
es: Vista general de los componentes disponibles de hardware para los equipos.
ja: チームが利用可能なハードウェアコンポーネントの概要。

source: Go to Hardware Overview
es: Ve a Hardware Overview
ja: ハードウェアの概要へ進む

source: **Software Overview**
ja: **ソフトウェアの概要**

source: An overview of the software components and tools available to teams.
es: Vista general de los componentes y herramientas de software disponibles para los equipos.
ja: チームが利用可能なソフトウェアコンポーネントとツールの概要。

source: Go to Software Overview
es: Ve a Software Overview
ja: ソフトウェアの概要へ進む

source: **Programming Basics**
ja: **プログラミングの基礎**

source: Documentation that is useful throughout a team's programming process.
es: Documentación que es útil a lo largo del proceso de programación de un equipo.
ja: プログラミングプロセス全体で役立つドキュメンテーション。

source: View articles
es: Ver artículos
ja: 記事を見る

source: **Advanced Programming**
ja: **高度なプログラミング**

source: Documentation that is suited toward veteran teams. This includes content such as Path Planning and Kinematics.
es: Es la documentación para los equipos más veteranos. Incluye contenido como Path Planning y Kinematics.
ja: ベテランチーム向けのドキュメンテーションです。これには、パスプランニングまたはキネマティクスなどのコンテンツが含まれます。

source: **Hardware**
ja: **ハードウェア**

source: Hardware tutorials and content available for teams.
es: Tutoriales de hardware y contenido disponible para equipos.
ja: チームに提供されるハードウェア関連のチュートリアルやその他の関連コンテンツ。

source: **Romi and XRP Robots**
es: **Romi y los robots XRP**
ja: **RomiとXRPのロボット**

source: The Romi and XRP robots are low-cost platforms for practicing WPILib programming.
es: Los robots Romi y XRP son plataformas de bajo costo para practicar la programación de WPILib.
ja: RomiとXRPロボットは、WPILibプログラミングを練習するための低価格なプラットフォームです。

source: View Romi articles
es: Vea artículos de Romi
ja: Romiについての記事を表示する

source: View XRP articles
es: Vea artículos de XRP
ja: XRPについての記事を表示する

source: **API Documentation**
es: **Documentación de la API**
ja: **API のドキュメンテーション**

source: Java and C++ class documentation.
es: Documentación de clases de Java y C++.
ja: JavaとC++のクラスのドキュメンテーション。

source: **Software Tools**
es: **Herramientas de software**
ja: **ソフトウェアツール**

source: Essential tooling such as FRC Driver Station, Dashboards, roboRIO Imaging Tool and more.
es: Herramientas esenciales como son FRC Driver Station, Dashboards, roboRIO Imaging Tool y mas.
ja: FRCドライバーステーション、ダッシュボード、roboRIOイメージングツールなどの必要なツール。

source: **Example Projects**
es: **Proyectos de ejemplo**
ja: **サンプルプロジェクト**

source: This section showcases the available example projects that teams can reference in VS Code.
es: Esta sección muestra los proyectos de ejemplo disponibles a los que los equipos pueden hacer referencia en VS Code.
ja: このセクションでは、チームがVS Codeで参照できる利用可能なサンプルプロジェクトが紹介されます。

source: **Status Light Quick Reference**
es: **Referencia rápida de la luz de estado**
ja: **ステータスライトのクイックリファレンス**

source: Quick reference guide for the status lights on a variety of FRC hardware.
es: Guía de referencia rápida para las luces de estado en una variedad de hardware de FRC.
ja: さまざまなFRCハードウェアのステータスライトのクイックリファレンスガイド。

source: View article
es: Ver artículo
ja: 記事を表示する

source: **3rd Party libraries**
es: **Bibliotecas de terceros**
ja: **サードパーティライブラリ**

source: Tutorial on adding 3rd party libraries such as CTRE and REV to your robot project.
es: Tutorial sobre cómo agregar bibliotecas de terceros como CTRE y REV a su proyecto de robot.
ja: ロボットプロジェクトに CTRE または REV などのサードパーティライブラリを追加するためのチュートリアル。

source: Issues
es: Problemas

source: If you are a returning team, please check out the overview of changes from 2023 to 2024 and the known issues.
es: Si eres un equipo que regresa, por favor revisa el resumen de los cambios de 2023 a 2024 y los problemas conocidos.
