Repository: sciencewhiz/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/networking/networking-introduction/ip-configurations.po
Languages: he_il

source: IP Configurations
he_il: קונפיגורציות IP

source: This document describes the IP configuration used at events, both on the fields and in the pits, potential issues and workaround configurations.
he_il: מסמך זה את מתאר התצורה של כתובת ה-IP שמשמשת באירועים, במגרש ובפיט, בעיות אפשריות והגדרות חילופיות.

source: TE.AM IP Notation
he_il: הסימון TE.AM עבור IP

source: The notation TE.AM is used as part of IPs in numerous places in this document. This notation refers to splitting your four digit team number into two digit pairs for the IP address octets.
he_il: הסימול TE.AM משמש כחלק מכתובות ה-IP במקומות רבים במסמך זה. הסימול מתייחס לחלוקת מספר הקבוצה שלכם המורכב מארבע ספרות לזוגות של שתי ספרות לכל אוקטטה של כתובת ה-IP.

source: Example: ``10.TE.AM.2``
he_il: למשל: ``10.TE.AM.2``

source: Team 12 - ``10.0.12.2``
he_il: קבוצה 12 - ``10.0.12.2``

source: Team 122 - ``10.1.22.2``
he_il: קבוצה 122 - ``10.1.22.2``

source: Team 1212 - ``10.12.12.2``
he_il: קבוצה 1212 - ``10.12.12.2``

source: Team 1202 - ``10.12.2.2``
he_il: קבוצה 1202 - ``10.12.2.2``

source: Team 1220 - ``10.12.20.2``
he_il: קבוצה 1220 - ``10.12.20.2``

source: Team 3456 - ``10.34.56.2``
he_il: קבוצת 3456 - ``10.34.56.2``

source: On the Field
he_il: על המגרש

source: This section describes networking when connected to the Field Network for match play
he_il: קטע זה מתאר את הרשת כאשר מחוברים לרשת המגרש עבור משחק מקצה.

source: On the Field DHCP Configuration
he_il: קונפיגורצית DHCP במגרש

source: The Field Network runs a :term:`DHCP` server with pools for each team that will hand out addresses in the range of ``10.TE.AM.20`` to ``10.TE.AM.199`` with a subnet mask of ``255.255.255.0``, and a default gateway of ``10.TE.AM.4``. When configured for an event, the Team Radio runs a DHCP server with a pool for devices onboard the robot that will hand out addresses in the range of 10.TE.AM.200 to 10.TE.AM.219 with a subnet mask of 255.255.255.0, and a gateway of 10.TE.AM.1.
he_il: רשת המגרש מפעילה שרת :term:`DHCP` עם פול כתובות עבור כל קבוצה שמחלק כתובות בטווח של ``10.TE.AM.20`` עד ``10.TE.AM.199`` עם subnet mask של ``255.255.255.0`` ו-default gateway של ``10.TE.AM.4``. כאשר מוגדר עבור אירוע, ה-Radio של הקבוצה מפעיל שרת DHCP עם פול כתובת עבור המכשירים בפנים הרובוט שיחלק כתובות בטווח ``10.TE.AM.200`` עד ``10.TE.AM.219`` עם subnet mask של ``255.255.255.0`` ו-gateway של ``10.TE.AM.1``.

source: OpenMesh OM5P-AN or OM5P-AC radio - Static ``10.TE.AM.1`` programmed by Kiosk
he_il: OpenMesh OM5P-AN או OM5P-AC radio - כתובת ``10.TE.AM.1`` סטטית נקבעת על ידי ה-Kiosk

source: roboRIO - DHCP ``10.TE.AM.2`` assigned by the Robot Radio
he_il: roboRIO - משוייך על ידי ה-Robot Radio ל-``10.TE.AM.2``

source: Driver Station - DHCP ("Obtain an IP address automatically") 10.TE.AM.X assigned by field
he_il: Driver Station - DHCP ("משיג כתובת IP באופן אוטומטי") 10.TE.AM.X מוקצה על ידי המגרש

source: IP camera (if used) - DHCP ``10.TE.AM.Y`` assigned by Robot Radio
he_il: מצלמת IP (אם בשימוש) - DHCP ``10.TE.AM.Y` מוקצה על ידי ה-Robot Radio

source: Other devices (if used) - DHCP ``10.TE.AM.Z`` assigned by Robot Radio
he_il: מכשירים אחרים (אם בשימוש) - DHCP ``10.TE.AM.Z`` מוקצה על ידי ה-Robot Radio

source: On the Field Static Configuration
he_il: קונפיגורציה סטטית במגרש

source: OpenMesh radio - Static ``10.TE.AM.1`` programmed by Kiosk
he_il: OpenMesh radio - כתובת ``10.TE.AM.1`` סטטית נקבעת על ידי ה-Kiosk

source: In the Pits
he_il: בפיטים

source: In the Pits DHCP Configuration
he_il: קונפיגורצית DHCP בפיטים

source: OpenMesh radio - Static ``10.TE.AM.1`` programmed by Kiosk.
he_il: OpenMesh radio - כתובת ``10.TE.AM.1`` סטטית נקבעת על ידי ה-Kiosk

source: roboRIO - ``10.TE.AM.2``, assigned by Robot Radio
he_il: roboRIO - ``10.TE.AM.2``, מוקצה על ידי ה-Robot Radio

source: Driver Station - DHCP ("Obtain an IP address automatically"), ``10.TE.AM.X``, assigned by Robot Radio
he_il: Driver Station - DHCP ("משיג כתובת IP באופן אוטומטי"), ``10.TE.AM.X``, מוקצה על ידי ה-Robot Radio

source: IP camera (if used) - DHCP, ``10.TE.AM.Y``, assigned by Robot Radio
he_il: מצלמת IP (אם בשימוש) - DHCP, ``10.TE.AM.Y``, מוקצה על ידי ה-Robot Radio

source: Other devices (if used) - DHCP, ``10.TE.AM.Z``, assigned by Robot Radio
he_il: מכשירים אחרים (אם בשימוש) - DHCP, ``10.TE.AM.Z``, מוקצה על ידי ה-Robot Radio

source: In the Pits Static Configuration
he_il: קונפיגורציה סטטית בפיטים

source: It is also possible to configure static IPs on your devices to accommodate devices or software which do not support mDNS. When doing so you want to make sure to avoid addresses that will be in use when the robot is on the field network. These addresses are ``10.TE.AM.1`` for the OpenMesh radio and ``10.TE.AM.4`` for the field router.
he_il: כמו כן, ניתן גם להגדיר כתובות IP סטטיות בהתאמה למכשירים שלכם כדי להתאים למכשירים או לתוכנות שאינן תומכות ב-mDNS. כאשר אתם עושים זאת, עליכם למנוע כתובות שיהיו בשימוש כאשר הרובוט נמצא ברשת השדה. כתובות אלו הן ``10.TE.AM.1`` עבור ה-OpenMesh radio ו-``10.TE.AM.4`` עבור ראוטר המגרש.
