Repository: sciencewhiz/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/telemetry/datalog.po
Languages: es_mx

source: On-Robot Telemetry Recording Into Data Logs
es_mx: Registro de telemetría en robot en registros de datos

source: By default, no telemetry data is recorded (saved) on the robot. The ``DataLogManager`` class provides a convenient wrapper around the lower-level ``DataLog`` class for on-robot recording of telemetry data into data logs. The WPILib data logs are binary for size and speed reasons. In general, the data log facilities provided by WPILib have minimal overhead to robot code, as all file I/O is performed on a separate thread--the log operation consists of mainly a mutex acquisition and copying the data.
es_mx: De forma predeterminada, no se registra (guarda) ningún dato de telemetría en el robot. La clase "DataLogManager" proporciona un envoltorio conveniente alrededor de la clase "DataLog" una clase de nivel inferior para el registro en el robot de datos de telemetría. Los registros de datos de WPILib son binarios por razones de tamaño y velocidad. En general, las facilidades de registro de datos proporcionadas por WPILib tienen un sobrecosto mínimo para el código del robot, ya que toda la E/S de archivos se realiza en un hilo separado: la operación de registro consiste principalmente en la adquisición de un mutex y la copia de los datos.

source: Structure of Data Logs
es_mx: Estructura de los registros de datos

source: Similar to NetworkTables, data logs have the concept of entries with string identifiers (keys) with a specified data type. Unlike NetworkTables, the data type cannot be changed after the entry is created, and entries also have metadata--an arbitrary (but typically JSON) string that can be used to convey additional information about the entry such as the data source or data schema. Also unlike NetworkTables, data log operation is unidirectional--the ``DataLog`` class can only write data logs (it does not support read-back of written values) and the ``DataLogReader`` class can only read data logs (it does not support changing values in the data log).
es_mx: Similar a NetworkTables, los registros de datos tienen el concepto de entradas con identificadores de cadena (keys) con un tipo de datos especificado. A diferencia de NetworkTables, el tipo de datos no puede cambiarse después de que se crea la entrada, y las entradas también tienen metadatos: una cadena arbitraria (típicamente JSON) que se puede utilizar para transmitir información adicional sobre la entrada, como la fuente de datos o el esquema de datos. Además, a diferencia de NetworkTables, la operación de registro de datos es unidireccional: la clase ``DataLog`` solo puede escribir registros de datos (no admite la lectura de valores escritos) y la clase ``DataLogReader`` solo puede leer registros de datos (no admite el cambio de valores en el registro de datos).

source: Data logs consist of a series of timestamped records. Control records allow starting, finishing, or changing the metadata of entries, and data records record data value changes. Timestamps are stored in integer microseconds; when running on the RoboRIO, the FPGA timestamp is used (the same timestamp returned by ``Timer.getFPGATimestamp()``).
es_mx: Los registros de datos consisten en una serie de registros con marca de tiempo. Los registros de control permiten iniciar, finalizar o cambiar los metadatos de las entradas, y los registros de datos registran cambios en los valores de los datos. Las marcas de tiempo se almacenan en microsegundos enteros; cuando se ejecuta en el RoboRIO, se utiliza la marca de tiempo del FPGA (la misma marca de tiempo devuelta por ``Timer.getFPGATimestamp()``).

source: Standard Data Logging using DataLogManager
es_mx: Registro de datos estándar utilizando DataLogManager

source: The ``DataLogManager`` class (`Java <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/wpilibj/DataLogManager.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/beta/cpp/classfrc_1_1_data_log_manager.html>`__) provides a centralized data log that provides automatic data log file management. It automatically cleans up old files when disk space is low and renames the file based either on current date/time or (if available) competition match number. The data file will be saved to a USB flash drive if one is attached, or to ``/home/lvuser`` otherwise.
es_mx: La clase ``DataLogManager`` (`Java <https://github.wpilib.org/allwpilib/docs/beta/java/edu/wpi/first/wpilibj/DataLogManager.html>`__, `C++ <https://github.wpilib.org/allwpilib/docs/beta/cpp/classfrc_1_1_data_log_manager.html>`__) proporciona un registro de datos centralizado que ofrece una gestión automática de archivos de registro de datos. Limpia automáticamente los archivos antiguos cuando el espacio en disco es bajo y cambia el nombre del archivo según la fecha/hora actual o (si está disponible) el número de coincidencia de la competencia. El archivo de datos se guardará en una unidad flash USB si está conectada, o en "/home/lvuser" en caso contrario.

source: Log files are initially named ``FRC_TBD_{random}.wpilog`` until the DS connects. After the DS connects, the log file is renamed to ``FRC_yyyyMMdd_HHmmss.wpilog`` (where the date/time is UTC). If the FMS is connected and provides a match number, the log file is renamed to ``FRC_yyyyMMdd_HHmmss_{event}_{match}.wpilog``.
es_mx: Los archivos de registro se nombran inicialmente como ``FRC_TBD_{random}.wpilog`` hasta que se conecte el DS. Después de que el DS se conecta, el archivo de registro se renombra como ``FRC_yyyyMMdd_HHmmss.wpilog`` (donde la fecha/hora es UTC). Si el FMS está conectado y proporciona un número de partido, el archivo de registro se renombra como ``FRC_yyyyMMdd_HHmmss_{evento}_{partido}.wpilog``.

source: On startup, all existing log files where a DS has not been connected will be deleted. If there is less than 50 MB of free space on the target storage, ``FRC_`` log files are deleted (oldest to newest) until there is 50 MB free OR there are 10 files remaining.
es_mx: Al iniciar, se eliminarán todos los archivos de registro existentes en los que no se haya conectado un DS. Si hay menos de 50 MB de espacio libre en el almacenamiento objetivo, se eliminarán los archivos de registro ``FRC_`` (del más antiguo al más nuevo) hasta que haya 50 MB libres O queden 10 archivos restantes.

source: The most basic usage of DataLogManager only requires a single line of code (typically this would be called from ``robotInit``). This will record all NetworkTables changes to the data log.
es_mx: El uso más básico de DataLogManager solo requiere una línea de código (normalmente esto se llamaría desde ``robotInit``). Esto registrará todos los cambios de NetworkTables en el registro de datos.
