Repository: sciencewhiz/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/introduction/common-control-issues.po
Languages: fr_ca

source: Common Control Loop Tuning Issues
fr_ca: Problèmes de réglage de boucles de contrôle communs

source: There are a number of common issues which can arise while tuning feedforward and feedback controllers.
fr_ca: Plusieurs problèmes courants peuvent survenir lors du réglage de contrôleurs prédictifs et à rétroaction

source: Integral Term Windup
fr_ca: Emballement du terme Intégral

source: Beware that if :math:`K_i` is too large, integral windup can occur. Following a large change in :term:`setpoint`, the integral term can accumulate an error larger than the maximal :term:`control effort`. As a result, the system overshoots and continues to increase until this accumulated error is unwound.
fr_ca: Sachez que si :math:`K_i` est trop grand, un emballement intégral peut se produire. Suite à un changement important du :term:`Point de consigne`, le terme intégral peut accumuler une erreur plus grande que l’ :term:`Entrée contrôlée` maximale. Par conséquent, le système dépasse les bornes et continue d'augmenter jusqu'à ce que cette erreur accumulée soit supprimée.

source: There are a few ways to mitigate this:
fr_ca: Il y a quelques manières de limiter cela:

source: Decrease the value of :math:`K_i`, down to zero if possible.
fr_ca: Diminuer la valeur de :math:`K_i`, à zéro, si possible

source: Add logic to reset the integrator term to zero if the :term:`output` is too far from the :term:`setpoint`. Some smart motor controllers and WPILib's ``PIDController`` implement this with a ``setIZone()`` method.
fr_ca: Ajouter un contrôle logique pour retourner le terme intégrateur à zéro, si le :term:`output` est trop éloigné du :term:`setpoint`. Certains contrôleurs de moteurs intelligents et la classe PIDController de WPILib implémentent ceci avec une méthode ``setIZone()``.

source: Cap the integrator at some maximum value. WPILib's ``PIDController`` implements this with the ``setIntegratorRange()`` method.
fr_ca: Limiter l'intégrateur à une valeur maximale. Le ``PIDController`` de la WPILib implémente ceci avec la méthode ``setIntegratorRange()``.

source: Most mechanisms in FRC do not require any integral control, and systems that seem to require integral control to respond well probably have an inaccurate feedforward model.
fr_ca: La plupart des mécanismes en FRC ne nécessitent aucun contrôle intégral et les systèmes qui semblent nécessiter un contrôle intégral pour répondre de manière adéquate utilisent probablement un modèle prédictif imprécis.

source: Voltage Sag
fr_ca: Affaissement du voltage

source: When we operate mechanisms on our robot, we draw current from its battery. This causes the available "bus voltage" that all the robot mechanisms operate off of to drop. This means that the performance of our mechanisms will vary depending on the loading and action of the robot - this is not ideal.
fr_ca: Lorsque nous opérons des mécanismes sur notre robot, nous débitons du courant de sa batterie. Ceci cause une baisse dans le voltage disponible sur le bus d'alimentation commun du robot. Cela signifie que la performance de nos mécanismes va varier selon la charge et l'action du robot - cela n'est pas idéal.

source: To fix this, most voltage controllers offer a "voltage compensation" setting for their internal control loops that keep the output voltage of the control loops constant despite changes in the bus voltage. The WPILib ``MotorController`` class offers a ``setVoltage`` method can do the same thing if the control loops are being run on the RIO (provided you call it every robot loop iteration).
fr_ca: Pour remédier à ceci, la plupart des contrôleurs de tension offrent un réglage «compensateur de tension» pour leur boucles de contrôle interne qui maintient la tension de sortie constante, malgré des changements de tension dans le bus commun. La classe ``MotorController`` de la WPILib offre une méthode ``setVoltage`` qui peut effectuer la même chose si les boucles de contrôle sont exécutées sur le RIO (supposant que vous l'appelez à chaque itération de la boucle robot).

source: Keep in mind that voltage compensation cannot increase the voltage applied to the motor beyond what is available on the bus - if your actuator is saturating (described below), you'll have to account for that separately.
fr_ca: Gardez en tête que la compensation de tension ne peut pas augmenter la tension appliquée au moteur plus haut que ce qui est disponible sur le bus - si votre actuateur est en saturation (décrit ci-bas), vous devrez prendre cela en compte séparément.

source: Actuator Saturation
fr_ca: Saturation de l'actuateur

source: A controller calculates its output based on the error between the :term:`setpoint` and the current :term:`state`. :term:`Plant <plant>` in the real world don't have unlimited control authority available for the controller to apply - that is to say, real mechanisms have some maximum achievable torque/acceleration and velocity.
fr_ca: Un contrôleur calcule sa sortie en fonction de l'erreur entre la :term:`Référence` et l’ :term:`état` actuel de :term:`l'Usine<plant>`. Dans une application réelle, nous n'avons pas un contrôle illimité disponible au contrôleur. Lorsque les limites de l'actionneur sont atteintes, le contrôleur agit comme si le gain avait été temporairement réduit.

source: If our control gains are too aggressive, our control algorithm might try to move the mechanism faster than it is capable of actually going. In this case, the mechanism will "saturate", and behave as if the control gains were smaller than they are. This might adversely affect control response (i.e., result in errors and instability).
fr_ca: Si nos gains de contrôle sont trop agressifs, notre algorithme de contrôle pourrait tenter de bouger le mécanisme plus loin que son étendue de mouvement. Dans ce cas, le mécanisme va se "saturer" et se comporter comme si les gains de contrôle étaient plus petits qu'ils ne le sont. Cela peut négativement impacter la réponse adverse de contrôle (ex: résulter en des erreurs et une instabilité).

source: If you are encountering problems with actuator saturation, consider modifying your mechanism gearing or powering it with a bigger motor.
fr_ca: Si vous rencontrez des problèmes de saturation d'actuateur, pensez à modifier votre mécanisme, en changeant son rapport d'engrenage ou en l'alimentant par un moteur plus puissant.
