Repository: sciencewhiz/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/romi-robot/programming-romi-*-labview.po
Languages: tr_tr

source: Programming the Romi (LabVIEW)
tr_tr: Romi Programlama(LabVIEW)

source: Writing a LabVIEW program for the Romi is very similar to writing a program for a regular roboRIO based robot. In fact, all the same tools can be used with the Romi.
tr_tr: Romi için LabVIEW programı yazmak, herhangi bir roboRIO tabanlı robot programı yazmaya çok benzer. Aslında, bütün benzer araçlar Romi ile kullanılabilir.

source: Creating a Romi Project
tr_tr: Romi Projesi Oluşturmak

source: Creating a new program for a Romi is no different than creating a normal FRC \|reg| program, similar to the :doc:`Zero To Robot </docs/zero-to-robot/step-4/index>` programming steps. Initially, you may wish to create a separate project for use on just the Romi as the Romi hardware may be connected to different ports than on your roboRIO robot.
tr_tr: Romi için yeni bir program oluşturmak, normal bir FRC \|reg| programı oluşturmaktan farklı değildir, :doc:`Sıfırdan Robota</docs/zero-to-robot/step-4/index>` programlama adımlarına benzer. Başlangıçta, Romi donanımı roboRIO robotunuzdan farklı bağlantı noktalarına bağlı olabileceğinden, sadece Romi üzerinde kullanmak için ayrı bir proje oluşturmak isteyebilirsiniz.

source: The Romi Robot used :term:`PWM` ports 0 and 1 for left and right side respectively.
tr_tr: Romi Robot, sol ve sağ taraf için sırasıyla :term:`PWM` 0 ve 1 portlarını kullanmıştır.

source: Todo
tr_tr: Yapmak

source: add information on romi gyro and encoders
tr_tr: romi gyro ve encoder'a bilgi ekle

source: Installing the WebSockets VI
tr_tr: WebSockets VI'ı indirme

source: One aspect where a Romi project differs from a regular FRC \|reg| robot project is that the code is not deployed directly to the Romi. Instead, a Romi project runs on your development computer, and leverages the WPILib simulation framework to communicate with the Romi robot. WebSockets is the protocol that LabVIEW uses to converse with the Romi.
tr_tr: Romi projesinin normal bir FRC \|reg| robot projesinden farklı olduğu bir nokta, kodun doğrudan Romi'ye dağıtılmamasıdır. Bunun yerine, bir Romi projesi geliştirme bilgisayarınızda çalışır ve Romi robotu ile iletişim kurmak için WPILib simülasyon çerçevesinden yararlanır. WebSockets, LabVIEW'in Romi ile iletişim kurmak için kullandığı protokoldür.

source: Open the :guilabel:`VI Package Manager` application. Type ``websockets`` into the search box in the top right. Select the VI by :guilabel:`LabVIEW Tools Network`.
tr_tr: :guilabel:`VI Package Manager` aplikasyonunu aç. Sağ üstteki arama kutusuna ``websockets`` yaz. :guilabel:`LabVIEW Tools Network`ten VI'yı seç.

source: Installing WebSockets via the VI Package Manager
tr_tr: VI Package Manager kullanarak WebSocket indirmek

source: Changing the Project Target
tr_tr: Proje Hedefini Değiştirme

source: The primary step needed to run your LabVIEW program on the Romi is to change the target to the Desktop. To change the project target, locate the Robot Main VI in the Project Explorer and click and drag it from the ``Target`` section to the ``My Computer`` section.
tr_tr: LabVIEW programınızı Romi üzerinde çalıştırmak için gereken birincil adım, hedefi Masaüstü olarak değiştirmektir. Proje hedefini değiştirmek için, Proje Gezgini'nde Robot Main VI'yı bulun ve tıklayıp ``Hedef`` bölümünden ``Bilgisayarım`` bölümüne sürükleyin.

source: An image showing moving Robot Main VI to the My Computer section
tr_tr: Robot Main VI'yı My Computer kısmına taşımayı gösteren bir resim

source: Setting the Target IP
tr_tr: Hedeflenen IP'yi Belirlemek

source: By default, your LabVIEW program will attempt to connect to a Romi with the IP address of ``10.0.0.2``. If you wish to use a different IP, you can specify it as an input to the ``Driver Station Start Communication VI`` inside ``Robot Main``. Locate the pink input terminal for ``Simulation URL`` then right-click and select :guilabel:`Create Constant` to create a constant pre-filled with the default value. You can then modify the IP address portion of the text, taking care to leave the protocol section (at the beginning) and port and suffix (at the end) the same.
tr_tr: Varsayılan olarak, LabVIEW programınız ``10.0.0.2`` IP adresine sahip bir Romi'ye bağlanmaya çalışacaktır. Farklı bir IP kullanmak isterseniz, bunu ``Robot Main`` içindeki ``Driver Station Start Communication VI`` için bir girdi olarak belirtebilirsiniz. ``Simulation URL`` si için pembe giriş terminalini bulun, ardından sağ tıklayın ve varsayılan değerle önceden doldurulmuş bir sabit oluşturmak için :guilabel:`Create Constant` seçeneğini seçin. Daha sonra metnin IP adresi kısmını değiştirebilir, protokol bölümünü (başlangıçta) ve port ve son eki (sonda) aynı bırakmaya dikkat edebilirsiniz.

source: An image showing the constant for an alternate IP
tr_tr: Alternatif bir IP için sabit gösteren bir resim

source: Running a Romi Program
tr_tr: Bir Romi Programı Çalıştırmak

source: To run a Romi program, first, ensure that your Romi is powered on. Once you connect to the ``WPILibPi-<number>`` network broadcast by the Romi, press the white :guilabel:`Run` arrow to start running the Romi program on your computer.
tr_tr: Bir Romi programı çalıştırmak için ilk başta Romi'nin açık olduğuna emin olun. Romi'nin ``WPILibPi-<number>`` ağ yayınına bağlandığınızda bilgisayarınızda Romi programını çalıştırmak için beyaz :guilabel:`Çalıştır` okuna basın.

source: Your Romi code is now running! The program will automatically attempt to connect to either the IP you have specified, or the default if you have not specified an IP.
tr_tr: Artık Romi kodunuz çalışıyor! Program, otamatik olarak belirttiğiniz IP'ye veya bir IP belirtmediyseniz varsayılan IP'ye bağlanmayı çalışacak.

source: It is recommended to run the Driver Station software on the same computer as the LabVIEW code. Once your program successfully connects to the Driver Station, it will automatically notify the Driver Station that the code is running on the Desktop, allowing the Driver Station to connect without you changing any information inside the Driver Station. Next, you'll need to point the Driver Station to your Romi. This is done by setting the team number to ``127.0.0.1``. You can then use the controls in the Driver Station to set the robot mode and enable/disable as normal.
tr_tr: Driver Station yazılımının LabVIEW koduyla aynı bilgisayarda çalıştırılması önerilir. Programınız Driver Station'a başarıyla bağlandığında, Driver Station'a kodun Masaüstünde çalıştığını otomatik olarak bildirecek ve Driver Station'ın içindeki herhangi bir bilgiyi değiştirmenize gerek kalmadan Driver Station'ın bağlanmasını sağlayacaktır. Ardından, Driver Station'ı Romi'nize yönlendirmeniz gerekir. Bu, takım numarasını ``127.0.0.1`` olarak ayarlayarak yapılır. Daha sonra robot modunu ayarlamak ve normal şekilde etkinleştirmek/devre dışı bırakmak için Driver Station'daki kontrolleri kullanabilirsiniz.

source: If your robot code is unable to connect to the Romi, the Driver Station will also show no connectivity.
tr_tr: Robot kodunuz Romi'ye bağlanamazsa, Driver Station da bağlantı olmadığını gösterecektir.

source: Using the Gyro or Encoder
tr_tr: Gyro veya Encoder'ı kullanmak

source: The gyro that is available on the Romi is available using the RomiGyro functions. This is located under
tr_tr: Romi'deki gyro, RomiGyro fonksiyonuyla kullanılabilir. Bu fonksiyon, şurada bulunabilir

source: The encoders can be used using the standard encoder function. The DIO ports are:
tr_tr: Encoder'lar standart encoder fonksiyonunuyla kullanılabilir. DIO portları da şunlardır:

source: Left (4, 5)
tr_tr: Sol(4, 5)

source: Right (6, 7)
tr_tr: Sağ(6, 7)
