Repository: sciencewhiz/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/xrp-robot/hardware-support.po
Languages: fr_ca

source: XRP Hardware Support
fr_ca: Prise en charge matérielle XRP

source: The XRP robot, having a different hardware architecture than a roboRIO, is compatible with a subset of commonly used FRC control system components.
fr_ca: Le robot XRP, ayant une architecture matérielle différente de celle d'un roboRIO, est compatible avec un sous-ensemble de composants du système de contrôle FRC couramment utilisés.

source: Compatible Hardware
fr_ca: Matériel compatible

source: In general, the XRP is compatible with the following:
fr_ca: En général, le XRP est compatible avec les éléments suivants :

source: Hobby DC motors with built-in encoders (6-pin connector)
fr_ca: Moteurs CC Hobby avec encodeurs intégrés (connecteur 6 broches)

source: Standard RC-style :term:`PWM` output devices (e.g. servos, PWM based motor controllers)
fr_ca: Dispositifs de sortie standard de style RC :term:`PWM` (par exemple, servos, contrôleurs de moteur basés sur PWM)

source: "Ping" style ultrasonic sensors (only when connected to the RANGE port)
fr_ca: Capteurs à ultrasons de style "Ping" (uniquement lorsqu'ils sont connectés au port RANGE)

source: Incompatible Hardware
fr_ca: Matériel incompatible

source: Due to hardware limitations, the XRP is not compatible with the following:
fr_ca: En raison de limitations matérielles, le XRP n'est pas compatible avec les éléments suivants :

source: Encoders other than those already integrated into hobby motors
fr_ca: Encodeurs autres que ceux déjà intégrés aux moteurs hobby

source: Timing based sensors
fr_ca: Capteurs basés sur le temps

source: CAN based devices
fr_ca: Appareils basés sur CAN

source: Compatible Classes
fr_ca: Classes compatibles

source: All classes listed here are supported by the XRP. If a class is not listed here, assume that it is not supported and *will not* work.
fr_ca: Toutes les classes répertoriées ici sont prises en charge par le XRP. Si une classe n'est pas répertoriée ici, supposez qu'elle n'est pas prise en charge et qu'elle *ne fonctionnera pas*.

source: The PWM motor controller classes (e.g. ``Spark``) and ``Servo`` are not supported. The XRP requires use of specialized ``XRPMotor`` and ``XRPServo`` classes.
fr_ca: Les classes de contrôleur de moteur PWM (par exemple « Spark ») et « Servo » ne sont pas prises en charge. Le XRP nécessite l'utilisation de classes spécialisées « XRPMotor » et « XRPServo ».

source: The following classes are provided by the XRP Vendordep (built-in to WPILib).
fr_ca: Les classes suivantes sont fournies par XRP Vendordep (intégré à WPILib).
